{
    "intro-h1": {
      "en": "HEY, I'M ALEX OUELLET FOURNIER",
      "fr": "BONJOUR, JE SUIS ALEX OUELLET FOURNIER"
    },
	"intro-p": {
		"en": "<p>A <strong>junior full-stack developer</strong> driven by curiosity and a passion for learning. I enjoy diving into both frontend and backend technologies, eager to expand my skills and contribute to innovative projects</p>",
		"fr": "<p>Un <strong>développeur full-stack junior</strong> motivé par la curiosité et la passion d'apprendre. J'aime me plonger dans les technologies frontend et backend, désireux d'élargir mes compétences et de contribuer à des projets innovants.</p>"
	},
	"language": {
		"en": "fr",
		"fr": "en"
	},
	"about": {
		"en": "About",
		"fr": "À propos"
	},
	"project": {
		"en": "Projects",
		"fr": "Projets"
	},
	"home": {
		"en": "Home",
		"fr": "Accueil"
	},
	"project-button": {
		"en": "PROJECTS",
		"fr": "PROJETS"
	},
	"skill-h1": {
		"en": "SKILLS",
		"fr": "COMPÉTENCES"
	},
	"about-h1": {
		"en": "ABOUT ME",
		"fr": "À PROPOS DE MOI"
	},
	"about-text-1":{
		"en": "As a 42 student, a renowned worldwide coding school known for its collaborative, project-based learning approach, I've developed a strong foundation in problem-solving, autonomy, and teamwork. This environment has shaped my ability to thrive in diverse settings and tackle challenges creatively.In addition to learning web development, I've acquired foundational expertise in C and C++, enhancing my technical capabilities and enabling a thorough approach to software development projects. Aside from programming, I have a deep passion for music. I also adore cats and am enthusiastic about traveling and learning languages.",
		"fr": "En tant qu'étudiant à 42, une école de programmation renommée à travers le monde pour son approche collaborative et basée sur les projets, j'ai développé une solide base en résolution de problèmes, autonomie et travail d'équipe. Cet environnement a façonné ma capacité à prospérer dans des contextes divers et à relever des défis de manière créative. En plus d'apprendre le développement web, j'ai acquis une expertise fondamentale en C et C++, renforçant mes compétences techniques et me permettant d'adopter une approche approfondie des projets de développement logiciel. En dehors de la programmation, j'ai une passion profonde pour la musique. J'adore également les chats et je suis enthousiaste à l'idée de voyager et d'apprendre des langues." 
	},
	"about-text-2":{
		"en": "I am currently seeking job opportunities where I can make a meaningful contribution, continue learning, and advance professionally. If there's a fitting opportunity that aligns with my skills and experience, please feel free to reach out. I look forward to connecting!",
		"fr": "Je suis actuellement à la recherche d'opportunités professionnelles où je peux apporter une contribution significative, continuer à apprendre et progresser dans ma carrière. Si une opportunité correspondant à mes compétences et à mon expérience se présente, n'hésitez pas à me contacter. J'ai hâte de faire votre connaissance !" 
	},
	"project-title": {
		"en": "PROJECTS",
		"fr": "PROJETS"
	},
	"aurora": {
		"en": "First attempt at creating a page using Bootstrap. It serves as a learning project where I explore the basics of web development, focusing on responsive design and layout using Bootstrap framework.",
		"fr": "Première tentative de création d'une page utilisant Bootstrap. Il s'agit d'un projet d'apprentissage où j'explore les bases du développement web, en mettant l'accent sur le design responsive et la mise en page à l'aide du framework Bootstrap."
	},
	"minishell": {
		"en": "Custom implementation of a Bash-like shell developed as a school project. It features command parsing and execution with arguments, along with our own built-in commands like echo, cd, pwd, export, unset, env, and exit.",
		"fr": "Implémentation personnalisée d'un shell similaire à Bash développée comme projet scolaire. Il comprend le parsing et l'exécution des commandes avec des arguments, ainsi que nos propres commandes intégrées comme echo, cd, pwd, export, unset, env, et exit."
	},
	"irc": {
		"en": "This project is about creating our own IRC server in c++ that follows the IRC protocol and that is compatible with LimeChat client.",
		"fr": "Ce projet consiste à créer notre propre serveur IRC en C++ qui suit le protocole IRC et qui est compatible avec le client LimeChat."
	},
	"raycast": {
		"en": "Implementation of raycasting in C, inspired by the iconic Wolfenstein 3D game engine. This project utilizes the raycasting algorithm to render a 3D world on a 2D screen.",
		"fr": "Implémentation du raycasting en C, inspirée par le moteur de jeu emblématique de Wolfenstein 3D. Ce projet utilise l'algorithme de raycasting pour rendre un monde 3D sur un écran 2D."
	},
	"2dgame": {
		"en": "This project is a simple 2D game written in C using the MLX42 graphics library.",
		"fr": "Ce projet est un jeu 2D simple écrit en C utilisant la bibliothèque graphique MLX42."
	},
	"info-button": {
		"en": "More info",
		"fr": "En savoir plus"
	},
	"contact-h1": {
		"en": "CONTACT ME",
		"fr": "CONTACTEZ-MOI"
	},
	"contact-text": {
		"en": "Feel free to reach me by submitting the form below, and I will get back to you as soon as possible!",
		"fr": "N'hésitez pas à me contacter en remplissant le formulaire ci-dessous. Je vous répondrai dès que possible !"
	},
	"name-text": {
		"en": "Your Name:",
		"fr": "Votre nom:"
	},"email-text": {
		"en": "Your Email:",
		"fr": "Votre adresse e-mail :"
	},
	"message-text": {
		"en": "Your Message:",
		"fr": "Votre message :"
	},
	"submit-btn": {
		"en": "SUBMIT",
		"fr": "ENVOYER"
	},
	"made-by": {
		"en": "Made by Alexandre Ouellet Fournier.",
		"fr": "Réalisé par Alexandre Ouellet Fournier."
	}
}